In [3]:
import pandas as pd

data = {'col1':['1','2','3','teks'],'col2':['1','2','3','4']}

df = pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [6]:
df.dtypes

col1    object
col2    object
dtype: object

In [8]:
# konversi tipe data menggunakan astype()
df_x = df.astype({'col2':'int'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [9]:
df_x.dtypes

col1    object
col2     int32
dtype: object

In [11]:
# konversi data numeric menggunakan to_numeric()
df.apply(pd.to_numeric,errors='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

In [12]:
df.dtypes

col1    object
col2    object
dtype: object